mysql/location/log/20260818.124835.name.0004.txt
sysbench 1.1.1-94740b0 (using system LuaJIT 2.1.1767980792)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Preparing queries
Preparing queries
Preparing queries
[...]
Threads started!

[ 1s ] thds: 4 tps: 99.48 qps: 202.94 (r/w/o: 202.94/0.00/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4 tps: 116.10 qps: 232.21 (r/w/o: 232.21/0.00/0.00) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4 tps: 120.10 qps: 240.20 (r/w/o: 240.20/0.00/0.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4 tps: 76.86 qps: 153.72 (r/w/o: 153.72/0.00/0.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4 tps: 117.52 qps: 234.03 (r/w/o: 234.03/0.00/0.00) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4 tps: 103.02 qps: 207.04 (r/w/o: 207.04/0.00/0.00) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4 tps: 76.99 qps: 153.98 (r/w/o: 153.98/0.00/0.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4 tps: 84.01 qps: 168.01 (r/w/o: 168.01/0.00/0.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4 tps: 96.56 qps: 193.12 (r/w/o: 193.12/0.00/0.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 85.00 qps: 170.01 (r/w/o: 170.01/0.00/0.00) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4 tps: 84.04 qps: 168.07 (r/w/o: 168.07/0.00/0.00) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4 tps: 85.04 qps: 170.08 (r/w/o: 170.08/0.00/0.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4 tps: 108.10 qps: 216.20 (r/w/o: 216.20/0.00/0.00) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4 tps: 118.87 qps: 237.74 (r/w/o: 237.74/0.00/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 105.94 qps: 211.88 (r/w/o: 211.88/0.00/0.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4 tps: 107.41 qps: 214.83 (r/w/o: 214.83/0.00/0.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4 tps: 99.67 qps: 199.35 (r/w/o: 199.35/0.00/0.00) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4 tps: 99.08 qps: 198.16 (r/w/o: 198.16/0.00/0.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4 tps: 98.84 qps: 197.68 (r/w/o: 197.68/0.00/0.00) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 121.11 qps: 242.23 (r/w/o: 242.23/0.00/0.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4 tps: 121.98 qps: 243.97 (r/w/o: 243.97/0.00/0.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4 tps: 123.90 qps: 247.80 (r/w/o: 247.80/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4 tps: 123.11 qps: 246.22 (r/w/o: 246.22/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4 tps: 122.09 qps: 244.18 (r/w/o: 244.18/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 121.86 qps: 243.71 (r/w/o: 243.71/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4 tps: 121.24 qps: 242.49 (r/w/o: 242.49/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4 tps: 120.75 qps: 241.49 (r/w/o: 241.49/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4 tps: 119.96 qps: 239.92 (r/w/o: 239.92/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4 tps: 119.00 qps: 238.01 (r/w/o: 238.01/0.00/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 113.10 qps: 226.20 (r/w/o: 226.20/0.00/0.00) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4 tps: 119.89 qps: 239.79 (r/w/o: 239.79/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4 tps: 120.02 qps: 240.04 (r/w/o: 240.04/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4 tps: 120.05 qps: 240.10 (r/w/o: 240.10/0.00/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4 tps: 115.95 qps: 231.89 (r/w/o: 231.89/0.00/0.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 108.50 qps: 217.00 (r/w/o: 217.00/0.00/0.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4 tps: 112.47 qps: 224.93 (r/w/o: 224.93/0.00/0.00) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4 tps: 99.99 qps: 199.97 (r/w/o: 199.97/0.00/0.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 4 tps: 94.45 qps: 188.90 (r/w/o: 188.90/0.00/0.00) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4 tps: 117.66 qps: 235.33 (r/w/o: 235.33/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 102.31 qps: 204.61 (r/w/o: 204.61/0.00/0.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4 tps: 115.67 qps: 231.33 (r/w/o: 231.33/0.00/0.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4 tps: 106.80 qps: 213.60 (r/w/o: 213.60/0.00/0.00) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4 tps: 95.00 qps: 190.00 (r/w/o: 190.00/0.00/0.00) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4 tps: 120.17 qps: 240.35 (r/w/o: 240.35/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 116.02 qps: 232.05 (r/w/o: 232.05/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4 tps: 117.12 qps: 234.23 (r/w/o: 234.23/0.00/0.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4 tps: 113.70 qps: 227.40 (r/w/o: 227.40/0.00/0.00) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4 tps: 119.07 qps: 238.14 (r/w/o: 238.14/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4 tps: 117.93 qps: 235.86 (r/w/o: 235.86/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 119.19 qps: 238.38 (r/w/o: 238.38/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4 tps: 119.95 qps: 239.90 (r/w/o: 239.90/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4 tps: 119.94 qps: 239.87 (r/w/o: 239.87/0.00/0.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4 tps: 117.17 qps: 234.35 (r/w/o: 234.35/0.00/0.00) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4 tps: 120.88 qps: 241.76 (r/w/o: 241.76/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 119.86 qps: 239.73 (r/w/o: 239.73/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4 tps: 122.15 qps: 243.31 (r/w/o: 243.31/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4 tps: 112.87 qps: 226.73 (r/w/o: 226.73/0.00/0.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4 tps: 118.99 qps: 237.98 (r/w/o: 237.98/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4 tps: 120.00 qps: 240.00 (r/w/o: 240.00/0.00/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 120.24 qps: 240.49 (r/w/o: 240.49/0.00/0.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      30.815 |*                                        33
      31.375 |*****                                    206
      31.945 |************                             483
      32.525 |********************************         1242
      33.116 |**************************************** 1552
      33.718 |*******************                      751
      34.330 |*********                                361
      34.954 |******                                   221
      35.589 |*****                                    190
      36.236 |****                                     142
      36.894 |***                                      125
      37.565 |***                                      110
      38.247 |**                                       87
      38.942 |***                                      100
      39.650 |***                                      102
      40.370 |***                                      99
      41.104 |**                                       79
      41.851 |**                                       85
      42.611 |*                                        57
      43.385 |**                                       64
      44.173 |*                                        48
      44.976 |*                                        53
      45.793 |*                                        41
      46.625 |*                                        36
      47.472 |*                                        40
      48.335 |*                                        33
      49.213 |*                                        30
      50.107 |*                                        28
      51.018 |*                                        23
      51.945 |                                         14
      52.889 |*                                        20
      53.850 |*                                        21
      54.828 |                                         10
      55.824 |                                         13
      56.839 |                                         14
      57.871 |                                         14
      58.923 |                                         9
      59.993 |                                         5
      61.083 |                                         6
      62.193 |                                         9
      63.323 |                                         3
      64.474 |                                         4
      65.645 |                                         5
      66.838 |                                         8
      68.053 |                                         4
      69.289 |                                         6
      70.548 |                                         4
      71.830 |                                         2
      73.135 |                                         3
      74.464 |                                         4
      75.817 |                                         4
      77.194 |                                         4
      78.597 |                                         2
      80.025 |                                         2
      81.479 |                                         1
      82.959 |                                         2
      84.467 |                                         3
      86.002 |                                         3
      87.564 |                                         2
      89.155 |                                         1
      90.775 |                                         1
      94.104 |                                         3
      95.814 |                                         4
      97.555 |                                         3
      99.327 |                                         4
     101.132 |                                         1
     102.969 |                                         1
     104.840 |                                         2
     106.745 |                                         1
     108.685 |                                         2
     112.670 |                                         5
     114.717 |                                         1
     116.802 |                                         1
     118.924 |                                         1
     123.285 |                                         1
     127.805 |                                         1
     132.492 |                                         1
     158.632 |                                         1
     161.514 |                                         1
     167.437 |                                         1
 
SQL statistics:
    queries performed:
        read:                            13318
        write:                           0
        other:                           0
        total:                           13318
    transactions:                        6659   (110.94 per sec.)
    queries:                             13318  (221.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      110.9361
    time elapsed:                        60.0255s
    total number of events:              6659

Latency (ms):
         min:                                  30.710
         avg:                                  36.053
         max:                                 167.452
         95th percentile:                      48.335
         sum:                              240075.586

Threads fairness:
    events (avg/stddev):           1664.7500/2.28
    execution time (avg/stddev):   60.0189/0.01